import "./Section2.sass";

const SVGComponent = (props) => (
  <svg
    className="cross"
    fill="#21dd8fff"
    width="800px"
    height="800px"
    viewBox="0 0 512 512"
    {...props}
  >
    <g id="Christian_cross">
      <path d="M400.7618,150.7H308.65V58.5925A13.1915,13.1915,0,0,0,295.4618,45.4H216.5425A13.1952,13.1952,0,0,0,203.35,58.5925V150.7H111.2425A13.1952,13.1952,0,0,0,98.05,163.8925v78.9193A13.1915,13.1915,0,0,0,111.2425,256H203.35V453.4118A13.1915,13.1915,0,0,0,216.5425,466.6h78.9193A13.1879,13.1879,0,0,0,308.65,453.4118V256h92.1118A13.1879,13.1879,0,0,0,413.95,242.8118V163.8925A13.1915,13.1915,0,0,0,400.7618,150.7ZM361.3,216.5125H269.1625V413.95a13.1625,13.1625,0,0,1-26.325,0V216.5125H150.7a13.1625,13.1625,0,1,1,0-26.325h92.1375V98.05a13.1625,13.1625,0,0,1,26.325,0v92.1375H361.3a13.1625,13.1625,0,0,1,0,26.325Z" />
    </g>
  </svg>
);
function Section2() {
  return (
    <section className="section2">
      <SVGComponent />
      <div className="text">
        <h1>Առանձնացված վայր</h1>
        <p>
          Տաճարի հիմնական գաղափարը միշտ եղել է սրբազան ծառայության համար հատուկ
          առանձնացված վայր ունենալը, իսկ ավելի որոշակի իմաստով, տաճարը բացառապես
          սրբազան ծեսերին և արարողություններին նվիրված կառույց է: Լատիներեն
          թեմպլում համազորն էր եբրայերեն բեթ Էլոհիմի և նշանակում էր Աստվածության
          բնակավայր, բառացի՝ Տիրոջ տուն: Նման շինություններ կառուցվել են տարբեր
          դարաշրջաններում՝ թե կռապաշտների և թե ճշմարիտ ու կենդանի Աստծո
          հետևորդների կողմից: Մինչ նման տաճարների դրսի տարածքը օգտագործվում էր
          ընդհանուր և հանրային արարողությունների համար, միշտ կային ներքին
          սենյակներ, որտեղ միայն օծված քահանաները կարող էին մտնել, և, ուստի, այդ
          մասերը կոչվում էին հայտնված աստվածության ներկայություն: Տաճարները
          երբեք չեն համարվել սովորական հասարակական հավաքատեղիներ, այլ համարվել
          են սուրբ կառույցներ՝ սրբագործված տվյալ պաշտամունքի համակարգի
          ամենահանդիսավոր ծեսերի համար:
        </p>
      </div>
    </section>
  );
}

export default Section2;
